package entities;

import calc.Calc;
import fx.Hexagon;
import java.awt.Image;
import java.awt.geom.Point2D;
import java.util.ArrayList;
import main.GraphicsHandler;

public class Wall extends Entity {

    public Wall(GraphicsHandler gh, Image image, Hexagon tile, Point2D location) {
        super(gh, Calc.cutHex(image), tile, location);
    }

    @Override
    public ArrayList<Hexagon> getOccupiedTiles() {
        occupiedTiles.clear();
        occupiedTiles.add(tile);
        return occupiedTiles;
    }
}

/* 
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⠏⠹⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⢶⣶⣶⣶⣶⣾⠏⠀⠀⠹⣷⣶⣶⣶⣶⡶⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣦⣄⠀⠀⠀⠀⠀⠀⠀⣠⣴⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢙⣷⠀⠀⠀⠀⠀⢾⣏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⣼⣃⣠⣴⣶⣄⣀⢹⣧⠀⠀⠀⠀⠀⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢀⣠⣶⠟⠁⠀⠀⠀⠀⢠⣿⠟⠋⠀⠀⠀⠀⠙⢿⣿⡄⠀⠀⠀⠀⠹⣿⣷⣤⠀⠀⠀⠀⠀⠀
⠀⠀⠀⢀⣼⢻⡿⣫⠀⠀⠀⠀⠀⠀⠋⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠙⠆⠀⠀⠀⠀⠀⢿⣿⣧⣷⣄⡀⠀⠀
⠀⠀⣰⢹⣟⣽⡾⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠳⣦⣄⡀⠀⠀⠀⠀⠀⠀⠀⠈⢻⣿⣽⡏⢳⡀⠀
⠀⢀⣿⢸⡿⣫⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣀⣀⠀⠀⠀⠙⢿⣦⡄⠀⠀⠀⠀⠀⠀⠈⣯⡿⣇⢸⡇⠀
⠀⡜⣿⢸⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⡿⠋⠀⠀⠀⠀⠈⢻⣿⣦⠀⠀⠀⠀⠀⠀⠘⣿⣮⢸⡟⡄
⢰⡇⢿⣿⢻⠆⠀⠀⠀⠀⠀⠀⠀⢴⣿⣿⡿⣿⣦⡀⠀⠀⠀⠀⠀⠀⢻⣿⣧⠀⠀⠀⠀⠀⠀⣯⢻⣿⢡⡇
⠘⣿⡘⢣⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠋⠀⠈⠻⣿⣦⡀⠀⠀⠀⠀⢸⣿⣿⡄⠀⠀⠀⠀⠀⢹⣧⠛⣾⡇
⢰⢿⣷⣼⡏⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣦⡀⠀⠀⣸⣿⣿⠇⠀⠀⠀⠀⠀⡞⣿⣾⡿⢱
⠘⣧⡻⣿⢰⣧⠀⠀⠀⠀⠀⠀⠀⠀⣠⣄⡀⠀⠀⠀⠀⠈⠻⣿⣦⣠⣿⣿⡿⠀⠀⠀⠀⠀⢰⣇⢸⠟⣰⡏
⠀⠹⣷⣌⢸⣿⢠⡀⠀⠀⠀⠀⢀⣼⡿⠙⠿⣿⣶⣦⣤⣤⣤⣼⣿⣿⣿⡟⠁⠀⠀⠀⠀⣰⢺⡿⣨⣾⠟⠀
⠀⠀⢯⠻⣿⣿⡈⣷⡀⠀⢠⣾⣿⠋⠀⠀⠀⠀⠉⠛⠻⠿⠿⠿⠿⠛⢿⣿⣦⡄⠀⠀⣸⡇⣼⣿⠟⣩⠂⠀
⠀⠀⠈⢿⣦⣙⡷⢻⣷⢦⡈⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠋⠀  ⣠⢶⣿⢑⣋⣴⡾⠋⠀⠀
⠀⠀⠀⠀⠉⡿⢿⣾⣿⣯⢿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀   ⣠⣾⢣⣿⣿⡿⢟⡏⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠈⠳⣶⣬⣭⣥⣽⣿⣦⡤⠄⣀⣀⣀⣀⣀⣀⣀⣀⣀⡤⣴⣾⣿⣥⣭⣤⣶⠾⠋⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠻⣭⣉⣉⣡⣴⣾⡿⠟⣩⡶⠋⠉⠳⣮⣙⠿⣿⣶⣤⣭⣭⣭⠿⠃⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⢴⠟⠁⠀⠀⠀⠀⠀⠙⣷⠄⠉⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
     D݂࣭݂ꪱׅ࣪ᧉ᩠֗ ִׂαׂׅׅ࣭֗ꬻִׂ໋ׅ֗ȶׂׅ݂࣭݂ꪱׅ࣪ƒִִׂ֗αִׂ໋ׅׅ࣪꯱ָׂɕִׄ˖ׅׄჩִׂ݂࣭݂ꪱִ໋ׅ࣪࣪꯱ִָׂ໋֗ȶׂׅ݂࣭݂ꪱִ໋ׅ࣪࣪꯱ָׂɕִׄ˖ׅׄჩִׂᧉ᩠֗ Mִׂαׂׅׅυᧉ᩠֗ꭉׂ໋ׅ ִ໋࣪꯱ָׂɕִׄ˖ׅׄჩִׂüִ໋֗ȶׂׅzִ໋֗ȶׂׅ Bᧉ᩠֗ꭉׂ໋ׅᥣ݂࣭݂ꪱׅ࣭࣪֗ꬻׂׅ
*/